Revit 2024 API
ViewSchedule.KeyScheduleParameterName Property
 In a key schedule, the name of the parameter for choosing one of the keys.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string KeyScheduleParameterName { get; set; }
Visual Basic
Public Property KeyScheduleParameterName As String
	Get
	Set
Visual C++
public:
property String^ KeyScheduleParameterName {
	String^ get ();
	void set (String^ value);
}
Field Value
 The name of the key schedule parameter.
Remarks
 When a key schedule is created, elements of the schedule's category receive a new parameter for choosing one of the keys defined in the key schedule. This is the name of that parameter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This ViewSchedule is not key schedule.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  When setting this property: The document containing this ViewSchedule is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- When setting this property: The document containing this ViewSchedule is being loaded, or is in the midst of another sensitive process. -or- When setting this property: This ViewSchedule is an internal element, such as a component of a loaded family or a group type. -or- When setting this property: The document containing this ViewSchedule is in Group Edit Mode, Sketch Edit Mode, or Paste Mode, and the element is not a member of the group, sketch, or clipboard. -or- When setting this property: This ViewSchedule is a member of a group or sketch, and the document is not currently editing the group or sketch.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  When setting this property: The document containing this ViewSchedule has no open transaction.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace